app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("account_id", "created_at", "description", "is_done", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["account_id", 1], ["created_at", "2016-12-03 19:26:54.539388"], ["description", "asdqwe"], ["is_done", "t"], ["name", "wena"], ["updated_at", "2016-12-03 19:26:54.539388"]]
---
  def create
    @task = @tasks.new(task_params)

    respond_to do |format|
      if @task.save

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."account_id" = ? AND "tasks"."id" = ? LIMIT 1  [["account_id", 1], ["id", 2]]
---
    def set_task
      @task = current_account.tasks.find(params[:id])